### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-09T18:23:03.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:7",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:8" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:8/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
!       s3_object_version              = "Bzv7mnh8N.hj3dxpm5Dtdu51a.BdLQFv" -> (known after apply)
        tags                           = {}
!       version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-core-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:*/*/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "9a971d750fcf9b6127f97e5f3de40231" -> (known after apply)
!       id                     = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> (known after apply)
!       key                    = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "Bzv7mnh8N.hj3dxpm5Dtdu51a.BdLQFv" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/app",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8426655591292305738" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
!           "timestamp" = "1691607140355940200" -> "1691607783814650000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "6533305607927039278" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "./.terraform/lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
+   resource "aws_lambda_layer_version" "this" {
+       arn                         = (known after apply)
+       compatible_runtimes         = [
+           "nodejs18.x",
        ]
+       created_date                = (known after apply)
+       description                 = "Node_modules layer"
+       id                          = (known after apply)
+       layer_arn                   = (known after apply)
+       layer_name                  = "cataprato-core-layer-s3"
+       s3_bucket                   = "cataprato-core-20230809150239447600000001"
+       s3_key                      = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
+       skip_destroy                = false
+       source_code_hash            = (known after apply)
+       source_code_size            = (known after apply)
+       version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "3920c179ac43ff5f8a3bab5a2252caf6-18" -> (known after apply)
!       id                     = "builds/a5b7e83e95eb8379cd3fa06e26c819ba6aee55ab88a925e59f2f9c78277b5ad2.zip" -> (known after apply)
!       key                    = "builds/a5b7e83e95eb8379cd3fa06e26c819ba6aee55ab88a925e59f2f9c78277b5ad2.zip" -> "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/a5b7e83e95eb8379cd3fa06e26c819ba6aee55ab88a925e59f2f9c78277b5ad2.zip" -> "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "QkSEIrV18Ya_Szt.EBzFJ9Vi97Ibk891" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function/",
+                       null,
                    ],
                ]
+               filename      = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "5527707674675783000" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a5b7e83e95eb8379cd3fa06e26c819ba6aee55ab88a925e59f2f9c78277b5ad2.zip" -> "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip"
!           "timestamp" = "1691607153528050000" -> "1691607796163153000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "5047155856611642240" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a5b7e83e95eb8379cd3fa06e26c819ba6aee55ab88a925e59f2f9c78277b5ad2.zip" -> "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 6 to destroy.
```
</details>